#pragma once

//===================================================================================
//이현총 씬 테스트 헤더파일
//===================================================================================
#include "particleTest.h"
#include "particleTest02.h"
#include "particleTest03.h"
#include "particleTest04.h"
#include "particleTest05.h"
#include "particleTest06.h"
#include "particleTest07.h"
#include "particleTest08.h"
#include "particleTest09.h"
#include "particleTest10.h"


//===================================================================================
//이현수 씬 테스트 헤더파일
//===================================================================================
#include "terrainPickingTest.h"


//===================================================================================
//김만웅 씬 테스트 헤더파일
//===================================================================================
#include "cLoadingBarTest.h"	//로딩바
#include "cLoadingTest.h"		//로딩
#include "cSceneTest.h"			//씬 테스트
#include "cGameNodeTest.h"		//그림자,카메라 분리
#include "cMeshTest.h"			//스킨드메쉬 테스트


//===================================================================================
//김태훈 씬 테스트 헤더파일
//===================================================================================


//===================================================================================
//김태승 씬 테스트 헤더파일
//===================================================================================



//===================================================================================
// mainGame클래스
//===================================================================================

class cLoading;

class mainGame
{
private:
	cLoading* m_pLoading;

public:
	mainGame();
	~mainGame();

	void OnUpdate();
	void OnRender();

	LRESULT CALLBACK MainProc(HWND hWnd, UINT iMessage, WPARAM wParam, LPARAM lParam);
};